app/controllers/movies_controller.rb

  def create
    movie = Movie.new(movie_params)
    movie.overview = params[:overview]
    movie.available_inventory = movie.inventory
    if movie.save
---
INSERT INTO "movies" ("title", "overview", "release_date", "inventory", "available_inventory", "created_at", "updated_at", "id") VALUES ('Psych', 'When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother. The place seems quirky, but fine… until Marion decides to take a shower', '1960-06-16', 8, 8, '2017-11-08 20:28:14.372169', '2017-11-08 20:28:14.372169', 287487352)