app/controllers/movies_controller.rb

  def index
    movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def show
    movie = Movie.find_by(id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    movie = Movie.new(movie_params)
    movie.overview = params[:overview]
    movie.available_inventory = movie.inventory
    if movie.save
---
INSERT INTO "movies" ("title", "release_date", "inventory", "created_at", "updated_at", "available_inventory") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Intersteller"], ["release_date", "2013-06-16"], ["inventory", 4], ["created_at", "2017-11-07 18:34:57.766267"], ["updated_at", "2017-11-07 18:34:57.766267"], ["available_inventory", 4]]