app/controllers/rentals_controller.rb

INSERT INTO "rentals" ("due_date", "customer_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["due_date", "Wed Nov 15 2017"], ["customer_id", 1], ["movie_id", 1], ["created_at", "2017-11-08 19:53:16.230875"], ["updated_at", "2017-11-08 19:53:16.230875"]]
---
  def create
    rental = Rental.new(rental_params)

    if rental.save