app/controllers/rentals_controller.rb

INSERT INTO "rentals" ("due_date", "created_at", "updated_at", "id", "movie_id", "customer_id") VALUES ('2017-12-12', '2017-11-08 04:33:25.427433', '2017-11-08 04:33:25.427433', 980190962, 287487352, 976610846)
INSERT INTO "movies" ("title", "overview", "release_date", "inventory", "available_inventory", "created_at", "updated_at", "id") VALUES ('Psych', 'When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother. The place seems quirky, but fine… until Marion decides to take a shower', '1960-06-16', 8, 8, '2017-11-08 04:33:25.416426', '2017-11-08 04:33:25.416426', 287487352)
INSERT INTO "customers" ("name", "registered_at", "address", "city", "state", "postal_code", "phone", "movies_checked_out_count", "created_at", "updated_at", "id") VALUES ('eva', 'eee', '23 Eva', 'Seattle', 'WA', '12345', '6173482743', 0, '2017-11-08 04:33:25.396318', '2017-11-08 04:33:25.396318', 848125802)
---
  def create
    rental = Rental.new(rental_params)

    if rental.save
      if rental.movie.decrease_inventory
        rental.movie.save
        rental.customer.increase_movies_checked_out_count
        rental.customer.save

UPDATE "rentals" SET "due_date" = $1, "updated_at" = $2 WHERE "rentals"."id" = $3  [["due_date", nil], ["updated_at", "2017-11-08 01:03:37.668285"], ["id", 298486374]]
UPDATE "movies" SET "available_inventory" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["available_inventory", 7], ["updated_at", "2017-11-08 01:03:37.677252"], ["id", 898238949]]
UPDATE "customers" SET "movies_checked_out_count" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["movies_checked_out_count", -1], ["updated_at", "2017-11-08 01:03:37.674470"], ["id", 848125802]]
---
  def update
    # puts "rental: #{params[:rental]}"
    # puts "customer_id: #{params[:customer_id]}"
    # puts "movie_id: #{params[:movie_id]}"
    rental = Rental.where(rental_params).first

    if rental
      rental.due_date = nil
      rental.save

      rental.movie.increase_inventory
      rental.movie.save
      rental.customer.decrease_movies_checked_out_count
      rental.customer.save